<a href="https://colab.research.google.com/github/Mahe-faure/db_testing/blob/main/DBWEEK10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
import sqlite3
from employee import Employee

conn = sqlite3.connect('memory:')

c = conn.cursor()

c.execute("""CREATE TABLE employees (
            first text,
            last text,
            pay integer)"""
            )

def insert_emp(emp):
  with conn:
    c.execute("INSERT INTO employees VALUES (:first, :last, :pay)", {'first': emp.first, 'last': emp.last, 'pay': emp.pay})

def get_emps_by_name(lastname):
  c.execute("SELECT * FROM employees")
  return c.fetchall()

def get_all_emps():
  c.execute("SELECT * FROM employees")
  return c.fetchall()

def delete_all_emps():
  c.execute("DELETE FROM employees")
  return c.fetchall()

def update_pay(emp, pay):
  with conn:
    c.execute("""UPDATE employees SET pay = :pay
                WHERE first = :first AND last = :last""",
                {'first': emp.first, 'last': emp.last, 'pay': pay})
def remove_emp(emp):
  with conn:
    c.execute("DELETE from employees WHERE first = :first AND last = :last",
              {'first': emp.first, 'last': emp.last})

emp_1 = Employee('John', 'Doe', 80000)
emp_2 = Employee('Jane', 'Doe', 90000)
emp_3 = Employee('Jane', 'Lee', 190000)
emp_4 = Employee('Yuna', 'Kim', 190000)

insert_emp(emp_1)
insert_emp(emp_2)
insert_emp(emp_3)
insert_emp(emp_4)

emps = get_emps_by_name('Doe')
print(emps)

emps1 = get_emps_by_name('Lee')
print(emps1)

update_pay(emp_2, 95000)
remove_emp(emp_1)

emps = get_emps_by_name('Doe')
print(emps)

all_emps = get_all_emps()
print(all_emps)

delete_all_emps()
all_emps = get_all_emps()
print(all_emps)

conn.close()

[('John', 'Doe', 80000), ('Jane', 'Doe', 90000), ('Jane', 'Lee', 190000), ('Yuna', 'Kim', 190000)]
[('John', 'Doe', 80000), ('Jane', 'Doe', 90000), ('Jane', 'Lee', 190000), ('Yuna', 'Kim', 190000)]
[('Jane', 'Doe', 95000), ('Jane', 'Lee', 190000), ('Yuna', 'Kim', 190000)]
[('Jane', 'Doe', 95000), ('Jane', 'Lee', 190000), ('Yuna', 'Kim', 190000)]
[]